#### 📖 Terraform Plan ('src/load-test/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_load_test.weu_common will be created
  + resource "azurerm_load_test" "weu_common" {
      + data_plane_uri      = (known after apply)
      + description         = "A Load Test resource with access to IO Prod environment to test private components"
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "io-p-weu-common-lt-01"
      + resource_group_name = "io-p-weu-load-test-rg-01"
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/load-test/prod"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_private_dns_zone_virtual_network_link.azurewebsites_private_vnet_itn_common will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "azurewebsites_private_vnet_itn_common" {
      + id                    = (known after apply)
      + name                  = "io-p-weu-load-test-vnet-01"
      + private_dns_zone_name = "privatelink.azurewebsites.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-rg-common"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/load-test/prod"
        }
      + virtual_network_id    = (known after apply)
    }

  # azurerm_resource_group.load_test will be created
  + resource "azurerm_resource_group" "load_test" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "io-p-weu-load-test-rg-01"
      + tags     = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/load-test/prod"
        }
    }

  # azurerm_subnet.weu_load_test will be created
  + resource "azurerm_subnet" "weu_load_test" {
      + address_prefixes                               = [
          + "10.40.0.0/26",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-weu-load-test-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-weu-load-test-rg-01"
      + virtual_network_name                           = "io-p-weu-load-test-vnet-01"
    }

  # azurerm_virtual_network.weu_load_test will be created
  + resource "azurerm_virtual_network" "weu_load_test" {
      + address_space       = [
          + "10.40.0.0/22",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "io-p-weu-load-test-vnet-01"
      + resource_group_name = "io-p-weu-load-test-rg-01"
      + subnet              = (known after apply)
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/load-test/prod"
        }
    }

  # azurerm_virtual_network_peering.weu_common will be created
  + resource "azurerm_virtual_network_peering" "weu_common" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-vnet-common-to-io-p-weu-load-test-vnet-01-peer"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "io-p-rg-common"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-vnet-common"
    }

  # azurerm_virtual_network_peering.weu_load_test will be created
  + resource "azurerm_virtual_network_peering" "weu_load_test" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = false
      + id                           = (known after apply)
      + name                         = "io-p-weu-load-test-vnet-01-to-io-p-vnet-common-peer"
      + remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common"
      + resource_group_name          = "io-p-weu-load-test-rg-01"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-weu-load-test-vnet-01"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + load_test_weu_common = {
      + id           = (known after apply)
      + location     = "westeurope"
      + name         = "io-p-weu-common-lt-01"
      + principal_id = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
